/**
  ******************************************************************************
  * @file    Config.h
  * @author  北京工业大学-贾桐
  * @version V1.0
  * @date    2019/3/1
  * @brief   参数配置文件
  ******************************************************************************
  * @attention
  *
  *
  ******************************************************************************
  */


#define GAME_MODE                        1                  // 1为参赛模式 0为常用模式，区别在于是否检测模块掉线后是否复位
#define PITCH_POSITION_USE_IMU           0                  // 0 PITCH反馈来自编码器 1 PITCH反馈来自IMU
#define PITCH_SPEED_USE_IMU              0                  // 0 PITCH反馈来自编码器 1 PITCH反馈来自IMU
/************************************************************************************************************/
/**************************************************控制参数**************************************************/
/************************************************************************************************************/
#define REMOTE_SPEED_ZOOM                10                 //遥控器拨杆放大系数
//#define MOUSE_SENSITIVITY_YAW            0.2f              //鼠标灵敏度
//#define MOUSE_SENSITIVITY_PITCH          0.2f
/************************************************************************************************************/
/**************************************************底盘参数**************************************************/
/************************************************************************************************************/
#define LOW                              1                        //底盘高度低
#define MID                              2                        //底盘高度中
#define HIGH                             3                        //底盘高度高
#define CHASSIS_MAX_SPEED                7500               //最大移动速度（最初为7200）
#define M3508_RAMP_RATIO_MAX             30                //3508上升斜坡（可考虑优化为抛物线）
#define M3508_RAMP_RATIO_MIN             8
#define CHASSIS_RAMP_RATIO               32                 //底盘斜坡
#define TWIST_RAMP_RATIO                 50                 //扭腰斜坡
#define TWIST_RANGE                      1000               //扭腰的范围
#define ROTATE_HIGH_SPEED                2200               //小陀螺旋转速度
#define ROTATE_NORMAL_SPEED              3000 

/************************************************************************************************************/
/**************************************************云台参数**************************************************/
/************************************************************************************************************/
#define KALMAN_FILTER_PAST_TIME          15                 //云台使用以前的数据，进行卡尔曼滤波
//YAW参数
#define YAW_POSITION_RAMP_RATIO          15                 //YAW斜坡
#define YAW_POSITION_INIT                7495                //YAW电机初始位置值
#define YAW_POSITION_MAX                 YAW_POSITION_INIT + 1200 //暂时未使用
#define YAW_POSITION_MIN								 YAW_POSITION_INIT - 1200 //暂时未使用

//PITCH参数
#define PITCH_POSITION_RAMP_RATIO        15                 //PITCH
#define PITCH_POSITION_INIT              6120               //PITCH电机初试位置值
#define PITCH_POSITION_MAX               6750
#define PITCH_POSITION_MIN               5620

//TRIGGER参数
#define TRIGGER_POSITION_RAMP_RATIO      34                 //斜坡
//底盘选择
#define CHASSIS_CHOOSE 1     															  //0为底盘选择功率优先  1为底盘选择血量优先






